rottenpotatoes/app/controllers/movies_controller.rb

  def same
    @movie = Movie.find params[:movie_id]
    @director = @movie.director
    if @director.blank?
      flash[:notice] = "'#{@movie.title}' has no director info"
      redirect_to movies_path
    else
      @movies = Movie.where(:director => @director)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'Rob Minkoff'